{
  "CommonClinicalResponses": {
    "cel": "PlF",
    "ct_1": "PlT 1",
    "sr_1": "RadS 1",
    "sr_2": "RadS 2",
    "ev_count": "Path E'reignis'folge",
    "ss_1": "SS 1",
    "ss_2": "SS 2",
    "first_ps": "1 des HSs",
    "is_dur": "IS Start Dauer",
    "is_start": "IS Start",
    "ms_1": "MS 1",
    "ms_1_2": "MS 1 Zweimal",
    "ms_1_dur": "MS 1 Dauer",
    "ms_2": "MS 2",
    "ms_2_dur": "MS 2 Dauer",
    "op_rating": "Ge Pat",
    "pathgen_dur": "PathGen Dauer",
    "pt_ev_dur": "Dauer des PE",
    "path_sev": "Path Schw'd",
    "ps_1": "HS 1",
    "ps_1_dur": "HS 1 Dauer",
    "ps_2": "HS 2",
    "ps_2_dur": "HS 2 Dauer",
    "ps_3": "HS 3",
    "ps_3_dur": "HS 3 Dauer",
    "ps_dur": "HS Dauer",
    "ps_level": "HS Schweregrad",
    "ps_prop": "Anteil der HSe",
    "recovery_dur": "Dauer der WHS",
    "recovery_prop": "Ad Verwertung",
    "slight_sr_1": "RadS 1 (möglich)",
    "slight_sr_2": "RadS 2 (möglich)",
    "ag_tim": "Zeitpunkt des Severity"
  },

  "MainPageHeading": {
    "": "Zweck",
    "Scatter": "Punktwolke",
    "Gantt": "Gantt",
    "TimeLine": "Zeitleiste",
    "HistogramMaker": "Histogramm",
    "SVG": "SVG",
    "WorldMap": "Weltkarte",
    "nIs": "N ist {{n}}"
  },

  "Header": {
    "close": "schließen",
    "open": "Öffnen",
    "openMenu": "Menü öffnen"
  },

  "KeyHintToggle": {
    "keyHint": "Tastenbereiche | 'k' drücken"
  },

  "Menu": {
    "ariaLabel": "Hauptmenü"
  },

  "LanguageToggle": {
    "languageToggle": "Sprache wechseln zu",
    "de": "DE",
    "en": "EN"
  },

  "Button": {
    "isDisabled": "ist derzeit deaktiviert{{selectedExtra}}",
    "isDisabledSelected": " weil derzeit ausgewählt",
    "primary": "primär"
  },

  "FilterButtonLabel": {
    "severe": "SV",
    "fjp": "Vorh.",
    "heo": "HE",
    "rmDubious": "Auch Fr.",
    "nonSevere": "NSV"
  },

  "Home": {
    "backgroundPanelLabel": "Hintergrund",
    "summaryPanelLabel": "Seite Zusammenfassung",
    "techStackPanelLabel": "Technischer Stapel"
  },

  "Background": {
    "heading1": "Einführung",
    "paragraph1": "Dieses Projekt ist aus einer früheren Arbeit entstanden, bei der ich freiwillig bei einer medizinischen Forschungsarbeit geholfen habe, lange vor der Begutachtung durch Fachkollegen, indem ich die Daten nahm und Werkzeuge bereitstellte, die vom Forscher verwendet werden konnten, um die Argumente für oder gegen die Hypothese zu untermauern. Die bereitgestellte Tabellenkalkulation wurde zu einer SQL-Datenbanktabelle und von dort aus wurde ein Front-End erstellt, um spezifische visuelle Beschreibungen der gesammelten Daten zu liefern, die von der Forschungsrichtung diktiert wurden; es wurde jedoch deutlich, dass ich es auch darüber hinaus verwenden konnte, um verschiedene kritische Fähigkeiten zu erforschen und zu verbessern. Jetzt, wo es sich von seinen Wurzeln gelöst hat, dient es mir weiterhin als Spielwiese, um Ideen in den technischen Bereichen zu erforschen, die ich gerne hätte.",
    "paragraph7": "Hinweis: Aus ethischen Gründen werden in den Diagrammen mit medizinischen Daten bewusst allgemeine Begriffe verwendet.",
    "heading2": "Erreichbarkeit",
    "paragraph2": "Ich verwende den Begriff \"Barrierefreiheit als erstklassiges Anliegen\", und das bedeutet für mich, dass sie in alles, was auf einer Website gemacht wird, integriert ist. Es ist nicht notwendig, dass ein Ticket dies ausdrücklich erwähnt, genauso wenig wie die Notwendigkeit von JavaScript in einem Ticket für ein React-Projekt erwähnt wird. Es ist von vornherein notwendig, weil es sich um eine Website handelt. Die Idee des \"erstklassigen Anliegens\" erhebt es auch über eine Gruppe sekundärer Anliegen wie React: Meine Website braucht React nicht, es ist nur ein sehr nützliches Werkzeug; es könnte nächstes Jahr um diese Zeit verschwunden sein, aber es ist wichtig, dass die Zugänglichkeit nicht verschwindet. Dies zeigt sich im gesamten Projekt auf vielfältige Weise, vom tiefen Verständnis von HTML bis hin zu einer eigenen permanenten Spalte im GitHub-Projekt.",
    "heading3": "Leistung",
    "paragraph3": "Leistung ist die Grundlage für Barrierefreiheit. Überkompliziertheit, übermäßiger Einsatz von Paketen, schlechte CSS-Lösungen, Aufblähung, unnötige Abstraktionen usw. usw. - die Liste ist lang - führen zu einem Web voller Websites, die die Möglichkeiten aller einschränken, die nicht über die beste technische Infrastruktur und/oder die leistungsfähigsten Geräte verfügen. Zum Zeitpunkt des Schreibens ist meine CSS-Produktionsdatei 5,3 KB groß; die letzte kommerzielle Website, an der ich gearbeitet habe, hatte über 1 MB CSS im JS; und ich muss mir noch überlegen, wie ich diese Auslieferung verbessern kann (z. B. durch Inlining von kritischem CSS oder die Verwendung von SASS-Mixins oder Includes auf der Grundlage der Ausgabe). Im Idealfall können die 4 oder 5 Milliarden Internetnutzer weltweit meine Website problemlos aufrufen, nicht nur die 1 Milliarde oder so in den privilegiertesten Positionen.",
    "heading4": "Erfahrungen von Entwicklern (DX)",
    "paragraph4": "Ich habe 2012/2013 zum ersten Mal über die Symmetrie des Verhältnisses zwischen Benutzer und Produkt (UX) und zwischen Entwickler und Produktarchitektur und -mechanik (DX) nachgedacht und seither langsam darüber nachgedacht und es immer wieder aufgegriffen. Begriffe wie kognitive Belastung, Kontextwechsel, einfache Wiederverwendung, Verständlichkeit, Lesbarkeit, Konsistenz und Empathie sind seitdem in Retros, Planung und PR-Reviews sowie in meinem eigenen Code zu finden. Da sich die Barrierefreiheit von der UX ableitet, verzweigt sich auch die Idee der Barrierefreiheit für Entwickler von DX, und ich integriere sie in die Gesamtidee von DX. Dieses Projekt gibt mir die Möglichkeit, mit meinen Ideen in diesem Bereich ungehindert ins kalte Wasser zu springen. Beachten Sie, dass ich derzeit nicht alle dieser Ideen als erfolgreich betrachte und auch nicht unbedingt positive Auswirkungen auf frühere Projekte hatte, obwohl ich versucht habe, diese Probleme zu erkennen und in späteren Iterationen zu vermeiden.",
    "heading5": "Warum mit der Datenvisualisierung fortfahren?",
    "paragraph5": "Die Datenvisualisierung stellt ein einziges Problem dar, das aus der Perspektive all der oben genannten Aspekte eine Herausforderung darstellt. Damit dies wirklich funktioniert, habe ich mich für eine Vorstellung von Komplexität entschieden, die dazu dient, einen Rahmen zu schaffen, der es ermöglicht, das Niveau dieser Herausforderungen bis an die Grenze zu treiben: Daten von unterschiedlicher struktureller Komplexität, die aber immer mit mindestens zwei Methoden präsentiert werden, einer visuellen und einer nicht-visuellen, wobei sowohl die Daten als auch die Präsentation eine komplexe Tiefe haben können und die Obergrenzen für jegliche Komplexität unscharf sind. Komplexität wird auch mit Flexibilität gepaart, die in eine ähnliche Richtung geht. Beachten Sie, dass \"nicht visuell\" bedeutet, dass die Präsentation ohne Sehvermögen verständlich ist, nicht unbedingt, dass eine zweite, nicht visuelle Präsentation visuell betrachtet werden kann.",
    "heading6": "Ein paar andere Anmerkungen",
    "paragraph6": "Im Grunde verwende ich die drei Hauptsprachen des Browsers: JS, CSS und HTML. Ich verwende absichtlich keine Datenvisualisierungspakete wie D3 oder VictoryChart. Ich beziehe mich oft auf die MDN-Dokumente, die von der Mozilla Foundation bereitgestellt werden, einer außergewöhnlichen Organisation. Das Frontend ist größtenteils responsive, auch hier ist die Datenvisualisierung eine Herausforderung."
  },

  "TechStack": {
    "paragraph6": "Auf dieser Seite werden nicht nur die Tools und Techniken aufgelistet, sondern auch einige Dinge, die mit der Zugänglichkeit, der Erfahrung der Entwickler und der Leistung zusammenhängen. Die Liste ist alphabetisch geordnet und erhebt keinen Anspruch auf Vollständigkeit, da sich die wichtigsten Themen und Technologien ständig ändern. Die Liste ist ziemlich feinkörnig und detailliert und reicht von einigen der bekanntesten Dinge in der Webtechnologie bis hin zu meinen eigenen Ideen, die vielleicht sogar neu sind.",

    "techStack__1__Label": "Abstraktion des Dienstprogramms",
    "techStack__1": " - die Herausnahme großer Mengen an Logik aus den Komponenten und die Verwendung gemeinsam nutzbarer util-Dateien, wodurch die Testbarkeit verbessert wird und die Dateien prägnanter und leichter verdaulich werden.",
    "techStack__2__Label": "Aria",
    "techStack__2": " - nicht-visuelle Kommunikation über HTML-Attribute zu ermöglichen. Eine gute Tag-Auswahl macht dies in vielen Fällen überflüssig.",
    "techStack__3__Label": "Axe and A11y",
    "techStack__3": " - Erweiterungen und Regelsätze, die mit React Testing Library und Story Book verbunden sind und die automatische Bewertung der Barrierefreiheit verbessern.",
    "techStack__4__Label": "BEM",
    "techStack__4": " - eine Namenskonvention, die __ und -- verwendet, um die Lesbarkeit in der Code-Basis zu verbessern, ursprünglich aus CSS, aber verbessert DX auch anderswo.",
    "techStack__5__Label": "CSS",
    "techStack__5": " - der Schlüssel zu einem responsiven Layout, das für alles zwischen Bildschirm und Auge verantwortlich ist, etwas, das ich seit V2 verwende.",
    "techStack__6__Label": "Flex-box model",
    "techStack__6": " - sehr gut durchdachtes Layoutsystem für Webseiten, ich benutze es seit Jahren erfolgreich und kenne es sehr gut.",
    "techStack__7__Label": "HTML",
    "techStack__7": " - no \"div soup\" - HTML muss gründlich erforscht werden, um die Zugänglichkeit und andere Funktionen, die es bietet, zu optimieren.",
    "techStack__8__Label": "I18next",
    "techStack__8": " - Werkzeug für die Bearbeitung von Übersetzungen.",
    "techStack__9__Label": "JS",
    "techStack__9": " - als zentrales Werkzeug, das das Web in Bewegung bringt, ist keine Einführung erforderlich. Ich habe mit diesem seit langem vor der Revolution 2015 gewesen.",
    "techStack__10__Label": "Kein Plural \"s\"",
    "techStack__10": " - eine Idee zur Zugänglichkeit für Entwickler: Englisch sollte nicht erforderlich sein, um Code zu verstehen, und es verbessert auch die Code-Suche: Denken Sie an \"activity\" und \"activities\".",
    "techStack__11__Label": "Konsistenz der Code-Basis",
    "techStack__11": " - Verringerung der kognitiven Belastung durch den Kontextwechsel, indem sichergestellt wird, dass alles, was gleich ist, auch gleich erscheint, basierend auf Ideen der Mustererkennung.",
    "techStack__12__Label": "Lighthouse",
    "techStack__12": " - die in Chrome integriert ist und zur Bewertung verschiedener Zugänglichkeits- und Leistungsmetriken auf dem Desktop oder auf dem Handy verwendet wird. Angestrebt werden durchgängig 100er.",
    "techStack__13__Label": "Organisation der Versorgungsunternehmen",
    "techStack__13": " - logische Aufteilung der Hilfsprogramme in vernünftig große Dateien mit ihren Tests.",
    "techStack__14__Label": "PropTypes",
    "techStack__14": " - über TypeScript gewählt. Die Dinge sind hier in der Schwebe, da TS die Beseitigung einer Menge von JS in PropTypes gebunden ermöglichen würde, aber die Anwendung TS ist eine große Aufgabe in diesem Stadium.",
    "techStack__15__Label": "Ramda",
    "techStack__15": " - eine wirklich nützliche Reihe von Datenmanipulationsfunktionen.",
    "techStack__16__Label": "ReactJS",
    "techStack__16": " - Rahmenwerk, das die Komponentisierung von Front-Ends und die Verwaltung des Zustands erleichtert.",
    "techStack__17__Label": "React Testing Library",
    "techStack__17": " - zur Abdeckung von Hilfsprogrammen und komplexeren Komponenten, die jedoch vom Server isoliert sind.",
    "techStack__18__Label": "Role and region",
    "techStack__18": " - zwei HTML-Attribute, die wie Metadaten für nicht-visuelle Werkzeuge funktionieren. Oft bringt die richtige Tag-Auswahl einen entsprechenden Wert.",
    "techStack__19__Label": "Sass",
    "techStack__19": " - eine Obermenge von CSS, die Programmierfunktionen und syntaktischen Zucker enthält, aber zu CSS kompiliert werden kann.",
    "techStack__20__Label": "Storybook",
    "techStack__20": " - als primäres visuelles Prüf- und Validierungsinstrument verwendet.",
    "techStack__21__Label": "SVG",
    "techStack__21": " - Koordinatenbasierte Zeichenschnittstelle mit breiter Unterstützung, schnell, offen, sehr detailliert und interaktiv.",
    "techStack__22__Label": "Übersetzt",
    "techStack__22": " - zugängliche Websites werden im Rahmen der Entwicklung übersetzt und/oder sind mit Tools von Drittanbietern übersetzbar. Die Website wurde vom ersten Tag an als übersetzbar konzipiert, indem i18n-Techniken für die direkte Übersetzung eingesetzt und Browsererweiterungen von Drittanbietern nicht blockiert wurden. Deutsch von DeepL.",
    "techStack__23__Label": "UX",
    "techStack__23": " - well I would love some actual users, typically I would be working closely with them.",
    "techStack__24__Label": "Zusammensetzbare Komponenten",
    "techStack__24": " - die wiederverwendet und gemeinsam genutzt werden können. Ich habe das schon vor React gemacht, nur eben serverseitig mit PHP."
  },

  "PageSummary": {
    "heading1": "Punktwolke",
    "link1": "/Scatter",
    "paragraph1": "Stellt X gegen Y dar. Beide Achsen können vom Benutzer ausgewählt werden.",
    "heading4": "Zeitleiste",
    "link4": "/TimeLine",
    "paragrpah5": "Aggregierte Gesamtbeträge, gruppiert nach Zeitblöcken, derzeit nur für Monate.",
    "heading5": "Gantt",
    "link5": "/Gantt",
    "paragraph6": "Berechnet statistische Daten von aggregierten Punkten aus den Einträgen im Datensatz und zeigt sie im Zeitverlauf im Gantt-Stil an. Der Benutzer kann auch einzelne Punkte auswählen, die dann gruppiert werden, um die Aggregationen bereitzustellen, d.h. der Benutzer wählt Punkt X aus, woraufhin zwei Gruppen 0-10 und 11-20 mit jeweils N Einträgen entstehen, aus denen dann Statistikdaten abgeleitet und angezeigt werden.",
    "heading6": "Histogramm",
    "link6": "/HistogramMaker",
    "paragraph7": "Ermöglicht dem Benutzer, einen Datenpunkt auszuwählen, nach dem gruppiert werden soll (X-Achse), dann N andere Datenpunkte, die in diesen Gruppen angeordnet werden sollen (Y-Achse), und eine Auswahl statistischer Ansichten, aus denen die Spalten gebildet werden können (z. B. Bereich, Maximum oder Anzahl).",
    "heading7": "SVG",
    "link7": "/SVG",
    "paragraph8": "Zieh- und Blockdiagramme dienen zur Darstellung der Aufschlüsselung einzelner Datenpunkte, wobei für jeden Punkt aggregierte Daten verfügbar sind. WIP.",
    "heading8": "World Map",
    "link8": "/WorldMap",
    "paragraph9": "Eine Weltkarte zum Vergleich von Werten über Länder und Zeit hinweg. WIP."
  },

  "Scatter": {
    "description": "Zwei Punktwolke, eines davon streng kontrolliert und hypothesengesteuert, das andere zur Erkundung durch den Benutzer",
    "interactiveChart": "Interaktive-Punktwolke"
  },

  "ScatterChart": {
    "notEnoughData": "Nicht genügend Daten für die Anzeige eines Diagramms"
  },

  "AxisSelector": {
    "axisGROUPBY": "Gruppen (Balken)",
    "axisSTATS": "Stats pro Gruppe",
    "axisX": "x-Achse (unten)",
    "axisY": "y-Achse (seite)",
    "close": "schließen",
    "open": "Öffnen",
    "primaryMark": "diese Auswahl für die Achse vermittelt die wichtigsten Informationen",
    "shownOnGROUPBY": "auf der Gruppen (Balken)-Achse dargestellt",
    "shownOnSTATS": "auf der Gruppe-Achse dargestellt",
    "shownOnX": "auf der X-Achse dargestellt",
    "shownOnY": "auf der Y-Achse dargestellt"
  },

  "AxisSelectorButton": {
    "shownOnX": "auf der X-Achse dargestellt",
    "shownOnY": "auf der Y-Achse dargestellt"
  },

  "ScatterStatisticOutput": {
    "label": "Liste der Statistiken basierend auf der Streuausgabe",
    "notEnoughData": "Nicht genügend Daten zur Durchführung statistischer Operationen",
    "sampleCorrelation": "Korrelation der Stichprobe",
    "sampleCovariance": "Kovarianz der Stichprobe"
  },

  "GanttScale": {
    "scaleFor": "Skala für {{AriaLabel}}"
  },

  "HistogramBarListLabel": {
    "aria-label": "{{groupBy}} Werte {{histogramBarListLabel}} mit Balken fur {{barList}}",
    "0-10": "..10",
    "10-20": "..20",
    "20-30": "..30",
    "30-40": "..40",
    "40-50": "..50"
  },

  "FactorToggle": {
    "ariaLabel": "Umschalttaste für den Faktor: zum Umschalten anklicken",
    "on": "Faktor ist eingeschaltet",
    "off": "Faktor ist ausgeschaltet",
    "turnOn": "Einschalten",
    "turnOff": "Ausschalten"
  },

  "OutcomeSummmary": {
    "total": "Alles",
    "severe": "Schwre",
    "nonSevere": "Nicht schwer",
    "outcomeSummary": "Zusammenfassung der Ergebnisspalte",
    "unknown": "Unbekannt"
  },

  "PredictiveHistogramListCounter": {
    "counterLabel": "Erhöhen Sie die Daten wie hinzugefügt"
  },

  "Gantt": {
    "subHeading": "Grundlegende Zeitstatistiken, über gemeinsame Antworten und mit interaktiven Querverweisen",
    "interactivePanelLabel": "Interaktive Gantt",
    "pathogenesisPanelLabel": "PathGen Gantt",
    "ariaLabel": "{{label}}; Bereich {{min}} bis {{max}} mit mean {{mean}} Standardabweichung {{minStd}} bis {{maxStd}}",
    "secondaryNav": "Siehe Antwortzeitstatistiken oder interaktiv, wo Sie auswählen können, was gruppiert werden soll und wo Sie Statistiken über"
  },

  "GeneralResponseGantt": {
    "GraphHeading": "Filterbare Bereiche und grundlegende Statistiken für schwere und nicht-schwere Antworten"
  },

  "InteractiveGantt": {
    "GraphHeading": "Interaktive Statistikliste, die es dem Benutzer ermöglicht, auszuwählen, was gruppiert werden soll, und die Zeitstatistiken für diese Gruppen anzuzeigen",
    "group": "{{k}} N={{count}}"
  },

  "GanntBar": {
    "good": "Wiederherstellungsantworten",
    "notGood": "Mittlere Antworten",
    "bad": "Ernsthafte Antworten",
    "veryBad": "Signifikante ernsthafte Reaktionen",
    "neutral": "Aufprall ohne Lager"
  },

  "GanttBarList": {
    "mean": "Mtlwrt",
    "range": "Bereich",
    "stddev": "Mdaabw",
    "mda": "MdA dev",
    "median": "Md",
    "skewness": "Skew",
    "quantile": "Qu",
    "mAndM": "Mean | Medn",
    "ranges": "lo | MDA | hi"
  },

  "GanttToggleList": {
    "mean": "Mtlwrt",
    "range": "Bereich",
    "min": "Min",
    "max": "Max",
    "median": "Md",
    "quantile": "Qunt",
    "quantileNumber": "Qunt Zahlen",
    "deviation": "MDA Abweichung",
    "label": "Etikett",
    "statList": "Statistiken",
    "fatLines": "Fette Linien"
  },

  "TimeLine": {
    "op_ratingPanelLabel": "Rating",
    "path_sevPanelLabel": "Severity",
    "celPanelLabel": "PlT",
    "secondaryNavSumAndFilterList": "Eine Reihe von Optionen für die Monate"
  },

  "HistogramMaker": {
    "countPanelLabel": "Zahlen",
    "avePanelLabel": "Median",
    "mdaPanelLabel": "Abweichung",
    "minPanelLabel": "Min",
    "maxPanelLabel": "Max",
    "rangePanelLabel": "Bereich"
  },

  "SVG": {
    "comingSoon": "Diese Seite wird in Kürze erscheinen ..."
  },

  "DragGraph": {
    "includeExtreme": "Schalten Sie den größten Wert in der Menge um, da dies das Diagramm verzerren kann.",
    "scaleDetail": "Hervorhebungen sind auf {{highlight}} und Stufen sind {{scaleUnit}}"
  },

  "DragGraphButton": {
    "aveSeverityShown": "Schweregrad",
    "incExtreme": "+",
    "outcomeShown": "Ergebnis",
    "map": "M"
  },

  "GraphSet": {
    "ce_1": "CE1",
    "ce_4": "CE4",
    "ct_1": "Ph1",
    "ct_2": "CT2",
    "ct_3": "CT3",
    "condr": "CD",
    "etiology": "ET",
    "ev_count": "Order",
    "outcome_type": "OT",
    "ps_level": "PSS",
    "src_hm": "S",
    "poc": "PoC",
    "outlier": "OutT",
    "boolean_set": "Bs",
    "testing": "This is a test key"
  },

  "ResetGraphButton": {
    "resetGraphCenter": "."
  },

  "ZoomButton": {
    "0.2": "0.2",
    "0.5": "0.5",
    "1": "1",
    "2": "2",
    "3": "3",
    "4": "4",
    "5": "5",
    "6": "6",
    "7": "7",
    "8": "8",
    "9": "9",
    "10": "10",
    "12": "12",
    "14": "14",
    "15": "15",
    "16": "16",
    "18": "18",
    "20": "20",
    "25": "25",
    "30": "30",
    "40": "40",
    "50": "50"
  },

  "WorldMap": {
    "blankPanelLabel": "Leere",
    "centuryPlusPerfTestPanelLabel": "124y perf test",
    "graphDataPanelLabel": "Diagramme - klicken Sie auf Afr/S.A.",
    "secondaryNav": "Umschalten der Kartendaten"
  },

  "MapSvgControlList": {
    "zoom": "Zoom"
  },

  "MapCountry": {
    "203": "Aruba",
      "4": "Afghanistan",
      "6": "Angola",
    "189": "Albanien",
    "190": "Andorra",
    "177": "Vereinigte Arabische Emirate",
      "8": "Argentinien",
      "9": "Armenien",
    "142": "Amerikanisch-Samoa",
      "7": "Antigua und Barbuda",
     "10": "Australien",
     "11": "Österreich",
     "12": "Aserbaidschan",
     "26": "Burundi",
    "192": "Belgien",
     "17": "Benin",
     "25": "Burkina Faso",
    "191": "Bangladesch",
     "24": "Bulgarien",
    "200": "Bahrain",
     "13": "Bahamas",
     "20": "Bosnien und Herzegowina",
     "15": "Weißrussland",
     "16": "Belize",
    "205": "Bermuda",
     "19": "Bolivien",
     "22": "Brasilien",
     "14": "Barbados",
     "23": "Brunei Darussalam",
     "18": "Bhutan",
     "21": "Botswana",
     "31": "Zentralafrikanische Republik",
     "29": "Kanada",
    "162": "Schweiz",
    "206": "Kanalinseln",
     "33": "Chile",
     "34": "China",
     "39": "Elfenbeinküste",
     "28": "Kamerun",
     "44": "Demokratische Republik Kongo",
     "37": "Kongo",
     "35": "Kolumbien",
     "36": "Komoren",
     "30": "Kap Verde",
     "38": "Costa Rica",
     "41": "Kuba",
    "207": "Curaçao",
    "208": "Kaimaninseln",
     "42": "Zypern",
     "43": "Tschechien",
     "64": "Deutschland",
    "193": "Dschibuti",
     "46": "Dominica",
     "45": "Dänemark",
     "47": "Dominikanische Republik",
      "5": "Algerien",
     "49": "Ecuador",
     "50": "Ägypten",
     "53": "Eritrea",
    "157": "Spanien",
     "54": "Estland",
     "56": "Äthiopien",
     "58": "Finnland",
     "57": "Fidschi",
     "59": "Frankreich",
    "211": "Färöer",
    "108": "Mikronesien",
     "61": "Gabun",
    "178": "Vereinigtes Königreich",
     "63": "Georgien",
     "65": "Ghana",
    "212": "Gibraltar",
     "70": "Guinea",
     "62": "Gambia",
     "71": "Guinea-Bissau",
     "52": "Äquatorialguinea",
     "66": "Griechenland",
     "68": "Grenada",
     "67": "Grönland",
     "69": "Guatemala",
      "2": "Guam",
     "72": "Guyana",
    "213": "Hongkong",
     "74": "Honduras",
     "40": "Kroatien",
     "73": "Haiti",
     "75": "Ungarn",
     "78": "Indonesien",
    "214": "Isle of Man",
     "77": "Indien",
     "81": "Irland",
     "79": "Iran",
     "80": "Irak",
     "76": "Island",
     "82": "Israel",
     "83": "Italien",
     "84": "Jamaika",
     "86": "Jordanien",
     "85": "Japan",
     "87": "Kasachstan",
     "88": "Kenia",
     "91": "Kirgisistan",
     "27": "Kambodscha",
     "89": "Kiribati",
    "139": "St. Kitts und Nevis",
    "155": "Südkorea",
    "201": "Kuwait",
     "92": "Laos",
     "94": "Libanon",
     "95": "Liberia",
     "96": "Libyen",
    "140": "St. Lucia",
    "194": "Liechtenstein",
    "158": "Sri Lanka",
    "195": "Lesotho",
     "97": "Litauen",
     "98": "Luxemburg",
     "93": "Lettland",
    "215": "Macao",
     "60": "St. Martin",
    "112": "Marokko",
    "196": "Monaco",
    "109": "Republik Moldau",
     "99": "Madagaskar",
    "102": "Malediven",
    "107": "Mexiko",
    "209": "Marshallinseln",
    "125": "Nordmazedonien",
    "103": "Mali",
    "104": "Malta",
    "114": "Myanmar",
    "111": "Montenegro",
    "110": "Mongolei",
    "217": "Nördliche Marianen",
    "113": "Mosambik",
    "105": "Mauretanien",
    "106": "Mauritius",
    "100": "Malawi",
    "101": "Malaysia",
    "115": "Namibia",
    "119": "Neukaledonien",
    "122": "Niger",
    "123": "Nigeria",
    "121": "Nicaragua",
    "118": "Niederlande",
    "197": "Norwegen",
    "117": "Nepal",
    "116": "Nauru",
    "120": "Neuseeland",
    "198": "Oman",
    "126": "Pakistan",
    "128": "Panama",
    "131": "Peru",
    "132": "Philippinen",
      "3": "Palau",
    "129": "Papua-Neuguinea",
    "133": "Polen",
    "135": "Puerto Rico",
    "124": "Nordkorea",
    "134": "Portugal",
    "130": "Paraguay",
    "127": "Palästinensische Autonomiegebiete",
    "169": "Französisch-Polynesien",
    "202": "Katar",
    "136": "Rumänien",
    "137": "Russland",
    "138": "Ruanda",
    "144": "Saudi-Arabien",
    "159": "Sudan",
    "145": "Senegal",
    "149": "Singapur",
    "152": "Salomonen",
    "148": "Sierra Leone",
     "51": "El Salvador",
    "199": "San Marino",
    "153": "Somalia",
    "146": "Serbien",
    "156": "Südsudan",
    "143": "São Tomé und Príncipe",
    "160": "Suriname",
    "150": "Slowakei",
    "151": "Slowenien",
    "161": "Schweden",
     "55": "Eswatini",
    "216": "Sint Maarten",
    "147": "Seychellen",
    "163": "Syrien",
    "218": "Turks- und Caicosinseln",
     "32": "Tschad",
    "168": "Togo",
    "164": "Taiwan",
    "167": "Thailand",
    "165": "Tadschikistan",
    "173": "Turkmenistan",
     "48": "Osttimor",
    "210": "Tonga",
    "170": "Trinidad und Tobago",
    "171": "Tunesien",
    "172": "Türkei",
    "174": "Tuvalu",
    "166": "Tansania",
    "175": "Uganda",
    "176": "Ukraine",
    "180": "Uruguay",
    "179": "Vereinigte Staaten",
    "181": "Usbekistan",
    "141": "St. Vincent und die Grenadinen",
    "183": "Venezuela",
    "219": "Britische Jungferninseln",
    "220": "Amerikanische Jungferninseln",
    "184": "Vietnam",
    "182": "Vanuatu",
    "204": "Samoa",
     "91": "Kosovo",
    "186": "Jemen",
    "154": "Südafrika",
    "187": "Sambia",
    "188": "Simbabwe",
    "185": "Westsahara",
    "43B": "Tschechoslowakei"
  },

  "ErrorList": {
    "ariaTranslationSet": "wenn translationSet verwendet wird, muss es ein Objekt sein, bei dem barList ein Array und groupBy eine Zeichenkette ist",
    "calcFineGrainedStepDivision": ">Mehr als 100 Abteilungen sind zu viel, als dass dies gut funktionieren könnte.",
    "calcHistogramBarGroupListGroupBy": "calcHistogramBarGroupList muss einen String groupBy haben",
    "calcHistogramBarGroupListPathogenesisStepList": "calcHistogramBarGroupList muss ein Array mit mindestens einer Pathogenesestufe enthalten",
    "calcInteractiveTimeBarArgs": "Die Daten für calcInteractiveGantt müssen ein Array sein und die aktuellen Benutzerauswahlen müssen Strings sein",
    "calcLeft": "calcLeft Funktion erfordert eine val bereitgestellt",
    "calcLeftScalePercFirstStep": "firstStep in calcLeftScalePerc muss eine Zahl sein",
    "calcPercentage": "calcPercentage Funktion erfordert eine val bereitgestellt",
    "calcScalePercNumbers": "calcScalePerc in GanttScale erfordert, dass beide Werte Zahlen sind",
    "calcScaleToFitUI": "calcScaleToFitUI erfordert ein scale-Argument mit den numerischen Eigenschaften stepDivision und totalSteps",
    "calcScaleToFitUITooManySteps": "calcScaleToFitUI in UtilGanttScale kann nicht mehr als 2000 als totalSteps-Wert haben",
    "calcStepDiffGoodDiff": "lastStep muss gleich oder größer sein als firstStep in calcStepDiff, GanttScale",
    "calcStepDiffNumbers": "calcStepDiff in GanttScale erfordert, dass beide Werte Zahlen sind",
    "calcWidth": "calcWidth Funktion erfordert eine min und max val",
    "dragGraphLabelValProp": "Die labelValList muss ein Array aus [string, object]-Arrays sein",
    "fnMustBeProvidedTo": "{{fnName}} muss {{caller}} zur Verfügung gestellt werden und muss eine Funktion sein",
    "fnMustHaveNumbers": "{{caller}} muss Zahlen in all diesen Parametern haben [{{numberKeyString}}]",
    "fullStatBase": "fullStatBase Funktion benötigt ein k",
    "generalResponseTimeBarDataIsArray": "Allgemeine Statistiklistenberechnung benötigt ein Array für Daten",
    "hueTotalError": "calcHue muss eine positive ganze Zahl in der Eigenschaft \"total\" enthalten",
    "histogramBarListTranslations": "die HistogramBarList muss entweder ein translationSet mit barList- und groupBy-Textwerten oder ein i18nBaseOverride haben, das die Komponenten zu diesen Übersetzungen umleitet",
    "isOrIsInArrayNeedsValues": "isOrIsInArray Wert Fehler. {{missing}}",
    "makeWidth": "makeWidth erfordert die Angabe eines Mindest- und Höchstwerts",
    "mapToGanttBars": "mapToGanttBars benötigt data mit Länge und eine i18nBase",
    "noDragGraphData": "Diese DragGraph-Konfiguration hat null Ergebnisse",
    "noHistogramData": "Diese Histogramm-Konfiguration hat null Ergebnisse",
    "numberPrecisionJustSingle": "numberPrecision erwartet nur eine einzelne Zahl, keine Zahlenreihen",
    "predictiveHistogramBarGroup": "Predictive histogram graph block list muss ein Array mit positiver Anzahl sein",
    "secondaryNavProps": "alle vier Args sind erforderlich, currentPanel, k und i18nBase sind alle Strings und setCurrentPanel sollte eine Funktion sein",
    "sliderYear": "startYear darf nicht nach endYear liegen",
    "sliderStepYear": "currentYear muss gleich oder nach startYear und gleich oder vor endYear liegen",
    "sortKeyError": "sortByKey-Funktion muss eine Zeichenkette als Schlüssel haben",
    "testError": "Test {{addToError}} {{alsoAddToError}}",
    "theThingListhInvalid": "theThingList ist nicht korrekt in {{callingFn}} - Empfangen: {{typeOf}} | {{val}}",
    "theThingListhZero": "theThingList hat die Länge 0, es sollte etwas in theThingList für {{callingFn}} enthalten sein",
    "userChoiceStatMapper": "userChoiceStatMapper benötigt einen String für currentResponse",
    "utilKeyPairXYMakeMapFn": "makeMapFn benötigt sowohl x als auch y, um die richtigen Schlüssel in jedem Punkt zu referenzieren",
    "writeHistogramBarListAriaLabel": "writeHistogramBarListAriaLabel erfordert histogramBarListLabel param"
  },

  "ReactTestLibrary": {
    "NOTE": "ONLY EN USED IN SB - FIND KEYS THERE"
  },

  "StoryBook": {
    "NOTE": "ONLY EN USED IN SB - FIND KEYS THERE"
  }
}
